; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v5)
             (pred_8 ?v9 ?v3)
             (pred_2 ?v4 ?v3)
             (pred_4 ?v11 ?v4 )
	     (pred_5 ?v4)
             (pred_6 ?v7)
             (pred_11 ?v9)
             (pred_9 ?v3)
             (pred_1 ?v4)
             (pred_7 ?v9)
             (pred_3 ?v4)
             (pred_12 ))



(:action op_1
:parameters (?v6 ?v12 ?v10 ?v8)
:precondition (and (pred_6 ?v6) (pred_6 ?v12) (pred_11 ?v10) (pred_9 ?v8)
          (pred_10 ?v6 ?v12) (pred_8 ?v10 ?v8)
                   (pred_2 ?v12 ?v8) (pred_5 ?v6) 
                   (pred_1 ?v12) (pred_7 ?v10))
:effect (and  (pred_3 ?v12) (not (pred_1 ?v12))))


(:action op_5
:parameters (?v6 ?v2)
:precondition (and (pred_6 ?v6) (pred_6 ?v2)
               (pred_5 ?v6) (pred_10 ?v6 ?v2) (pred_3 ?v2))
:effect (and (pred_5 ?v2) (not (pred_5 ?v6))))

(:action op_3
:parameters (?v6 ?v10)
:precondition (and (pred_6 ?v6) (pred_11 ?v10) 
                  (pred_5 ?v6) (pred_4 ?v10 ?v6) (pred_12 ))
:effect (and (pred_7 ?v10)
   (not (pred_4 ?v10 ?v6)) (not (pred_12 ))))


(:action op_2
:parameters (?v6 ?v1 ?v13)
:precondition (and (pred_6 ?v6) (pred_11 ?v1) (pred_11 ?v13)
                  (pred_5 ?v6) (pred_7 ?v13) (pred_4 ?v1 ?v6))
:effect (and (pred_7 ?v1) (pred_4 ?v13 ?v6)
        (not (pred_7 ?v13)) (not (pred_4 ?v1 ?v6))))

(:action op_4
:parameters (?v6 ?v10)
:precondition (and (pred_6 ?v6) (pred_11 ?v10) 
                  (pred_5 ?v6) (pred_7 ?v10))
:effect (and (pred_12 ) (pred_4 ?v10 ?v6) (not (pred_7 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_16 obj_12 obj_04 obj_02 obj_15 obj_19 obj_09 obj_01 obj_03 obj_06 obj_10 obj_18 obj_17 obj_13 obj_07
    obj_20 obj_05
    obj_14 obj_08 obj_21
    )

    (:init
       (pred_12)

       (pred_6 obj_11)
       (pred_6 obj_16)
       (pred_6 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_02)
       (pred_6 obj_15)
       (pred_6 obj_19)
       (pred_6 obj_09)
       (pred_6 obj_01)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_10)
       (pred_6 obj_18)
       (pred_6 obj_17)
       (pred_6 obj_13)
       (pred_6 obj_07)
       (pred_9 obj_20)
       (pred_9 obj_05)
       (pred_11 obj_14)
       (pred_11 obj_08)
       (pred_11 obj_21)

       (pred_10 obj_11 obj_02)
       (pred_10 obj_11 obj_16)
       (pred_10 obj_16 obj_15)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_16 obj_11)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_12 obj_04)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_15 obj_16)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_19 obj_06)
       (pred_10 obj_19 obj_09)
       (pred_10 obj_19 obj_12)
       (pred_10 obj_19 obj_15)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_09 obj_19)
       (pred_10 obj_01 obj_18)
       (pred_10 obj_01 obj_03)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_03 obj_17)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_03 obj_01)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_18 obj_01)
       (pred_10 obj_17 obj_13)
       (pred_10 obj_17 obj_03)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_13 obj_06)
       (pred_10 obj_13 obj_17)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_07 obj_13)
       (pred_1 obj_07)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_2  obj_07 obj_20)
       (pred_2  obj_12 obj_05)
       (pred_2  obj_16 obj_20)
       (pred_3 obj_11)
       (pred_3 obj_04)
       (pred_3 obj_02)
       (pred_3 obj_15)
       (pred_3 obj_19)
       (pred_3 obj_09)
       (pred_3 obj_01)
       (pred_3 obj_03)
       (pred_3 obj_06)
       (pred_3 obj_10)
       (pred_3 obj_18)
       (pred_3 obj_17)
       (pred_3 obj_13)

       (pred_8  obj_14 obj_20)
       (pred_8  obj_08 obj_05)
       (pred_8  obj_21 obj_20)
       (pred_4 obj_14 obj_01)
       (pred_4 obj_08 obj_15)
       (pred_4 obj_21 obj_10)
       (pred_5 obj_10)
    )

    (:goal (and
       (pred_4 obj_14 obj_06)
       (pred_4 obj_08 obj_17)
       (pred_4 obj_21 obj_15)
    ))
(:constraints
  (always (not (pred_5 obj_03)))
)
)

; plan
1. (op_3 obj_10 obj_21)
   deleted: (pred_4 obj_21 obj_10) (pred_12)
   added: (pred_7 obj_21)
   goals met: 0 of 3
2. (op_5 obj_10 obj_06)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_06)
   goals met: 0 of 3
3. (op_5 obj_06 obj_19)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_19)
   goals met: 0 of 3
4. (op_5 obj_19 obj_15)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_15)
   goals met: 0 of 3
5. (op_2 obj_15 obj_08 obj_21)
   deleted: (pred_7 obj_21) (pred_4 obj_08 obj_15)
   added: (pred_7 obj_08) (pred_4 obj_21 obj_15)
   goals met: 1 of 3
6. (op_5 obj_15 obj_02)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_02)
   goals met: 1 of 3
7. (op_5 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_01)
   goals met: 1 of 3
8. (op_5 obj_01 obj_18)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_18)
   goals met: 1 of 3
9. (op_5 obj_18 obj_17)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_17)
   goals met: 1 of 3
10. (op_4 obj_17 obj_08)
   deleted: (pred_7 obj_08)
   added: (pred_12) (pred_4 obj_08 obj_17)
   goals met: 2 of 3
11. (op_5 obj_17 obj_18)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_18)
   goals met: 2 of 3
12. (op_5 obj_18 obj_01)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_01)
   goals met: 2 of 3
13. (op_3 obj_01 obj_14)
   deleted: (pred_4 obj_14 obj_01) (pred_12)
   added: (pred_7 obj_14)
   goals met: 2 of 3
14. (op_5 obj_01 obj_02)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_02)
   goals met: 2 of 3
15. (op_5 obj_02 obj_15)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_15)
   goals met: 2 of 3
16. (op_5 obj_15 obj_19)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_19)
   goals met: 2 of 3
17. (op_5 obj_19 obj_06)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_06)
   goals met: 2 of 3
18. (op_4 obj_06 obj_14)
   deleted: (pred_7 obj_14)
   added: (pred_12) (pred_4 obj_14 obj_06)
   goals met: 3 of 3
